**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [11]:
import pandas as pd
import numpy as np
import warnings
data=[('a','b','c'),('d','e','f')]
df=pd.DataFrame(data,columns=['C1','C2','C3'])
df

  C1 C2 C3
0  a  b  c
1  d  e  f

In [12]:
df['C1'][0]=2

In [13]:
df

  C1 C2 C3
0  2  b  c
1  d  e  f

In [7]:
import pandas as pd
import numpy as np
data=[('a','Cranes',3.5,2,'yes'),
     ('b','Cranes',4,4,'yes'),
      ('c','plovers',1.5,3,'no'),
      ('d','spoonbills',np.nan,4,'yes'),
      ('e','spoonbills',6,3,'no'),
      ('f','Cranes',3,4,'no'),
      ('g','plovers',5.5,2,'no'),
      ('h','Cranes',np.nan,2,'yes'),
      ('i','spoonbills',8,3,'no'),
      ('j','spoonbills',4,2,'no')
     ]

df=pd.DataFrame(data, columns=['Labels','birds','age','visits','priority'])
df

  Labels       birds  age  visits priority
0      a      Cranes  3.5       2      yes
1      b      Cranes  4.0       4      yes
2      c     plovers  1.5       3       no
3      d  spoonbills  NaN       4      yes
4      e  spoonbills  6.0       3       no
5      f      Cranes  3.0       4       no
6      g     plovers  5.5       2       no
7      h      Cranes  NaN       2      yes
8      i  spoonbills  8.0       3       no
9      j  spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [8]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe **

In [9]:
df.iloc[:2]

  Labels   birds  age  visits priority
0      a  Cranes  3.5       2      yes
1      b  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [10]:
df[['birds','age']]

        birds  age
0      Cranes  3.5
1      Cranes  4.0
2     plovers  1.5
3  spoonbills  NaN
4  spoonbills  6.0
5      Cranes  3.0
6     plovers  5.5
7      Cranes  NaN
8  spoonbills  8.0
9  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [11]:
print(df[['birds','age','visits']].iloc[2])

print(df[['birds','age','visits']].iloc[3])

print(df[['birds','age','visits']].iloc[7])

birds     plovers
age           1.5
visits          3
Name: 2, dtype: object
birds     spoonbills
age              NaN
visits             4
Name: 3, dtype: object
birds     Cranes
age          NaN
visits         2
Name: 7, dtype: object

**6. select the rows where the number of visits is less than 4**

In [12]:
df[df['visits']<4]

  Labels       birds  age  visits priority
0      a      Cranes  3.5       2      yes
2      c     plovers  1.5       3       no
4      e  spoonbills  6.0       3       no
6      g     plovers  5.5       2       no
7      h      Cranes  NaN       2      yes
8      i  spoonbills  8.0       3       no
9      j  spoonbills  4.0       2       no

In [15]:
df['visits']<4

0     True
1    False
2     True
3    False
4     True
5    False
6     True
7     True
8     True
9     True
Name: visits, dtype: bool

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [17]:
df['age'].isnull().count()

10

In [23]:
df['visits'].isnull().count()

10

In [23]:
df[df['age'].isnull()]

  Labels       birds  age  visits priority
3      d  spoonbills  NaN       4      yes
7      h      Cranes  NaN       2      yes

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [32]:
 df[(df['birds'] == 'Cranes') & (df['age'] < 4)]

  Labels   birds  age  visits priority
0      a  Cranes  3.5       2      yes
5      f  Cranes  3.0       4       no

In [34]:
df[df['birds'] == 'Cranes']

  Labels   birds  age  visits priority
0      a  Cranes  3.5       2      yes
1      b  Cranes  4.0       4      yes
5      f  Cranes  3.0       4       no
7      h  Cranes  NaN       2      yes

**9. Select the rows the age is between 2 and 4(inclusive)**

In [88]:
df[(df['age']<=4) & (df['age']>=2)]

  Labels       birds  age  visits priority
0      a      Cranes  3.5       2      yes
1      b      Cranes  4.0       4      yes
5      f      Cranes  3.0       4       no
9      j  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [89]:
df[(df['birds'] == 'Cranes') & (df['visits'] > 0)].sum()

Labels                          abfh
birds       CranesCranesCranesCranes
age                             10.5
visits                            12
priority                 yesyesnoyes
dtype: object

**11. Calculate the mean age for each different birds in dataframe.**

In [93]:
print(df['age'][(df['birds'] == 'Cranes')].mean())

print(df['age'][(df['birds'] == 'spoonbills')].mean())
print(df['age'][(df['birds'] == 'plovers')].mean())

3.5
6.0
3.5

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [35]:
new_row=[('k','peacock',3,15,"yes")]
df1=pd.DataFrame(new_row,columns=['Labels','birds','age','visits','priority'])
df1

  Labels    birds  age  visits priority
0      k  peacock    3      15      yes

In [37]:
df2=pd.concat([df,df1],ignore_index=True)
#df2=df2.drop(10)
df2

   Labels       birds  age  visits priority
0       a      Cranes  3.5       2      yes
1       b      Cranes  4.0       4      yes
2       c     plovers  1.5       3       no
3       d  spoonbills  NaN       4      yes
4       e  spoonbills  6.0       3       no
5       f      Cranes  3.0       4       no
6       g     plovers  5.5       2       no
7       h      Cranes  NaN       2      yes
8       i  spoonbills  8.0       3       no
9       j  spoonbills  4.0       2       no
10      k     peacock  3.0      15      yes

**13. Find the number of each type of birds in dataframe (Counts)**

In [96]:
g=df.groupby('birds').count()
g

            Labels  age  visits  priority
birds
Cranes           4    3       4         4
plovers          2    2       2         2
spoonbills       4    3       4         4

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [115]:
df_age=df.sort_values('age',ascending=False)
print('sort_by_age\n',df_age)

df_visits=df_age.sort_values('visits')

print('sort_by_visits\n',df_visits)

sort_by_age
   Labels       birds  age  visits priority
8      i  spoonbills  8.0       3       no
4      e  spoonbills  6.0       3       no
6      g     plovers  5.5       2       no
1      b      Cranes  4.0       4      yes
9      j  spoonbills  4.0       2       no
0      a      Cranes  3.5       2      yes
5      f      Cranes  3.0       4       no
2      c     plovers  1.5       3       no
3      d  spoonbills  NaN       4      yes
7      h      Cranes  NaN       2      yes
sort_by_visits
   Labels       birds  age  visits priority
6      g     plovers  5.5       2       no
9      j  spoonbills  4.0       2       no
0      a      Cranes  3.5       2      yes
7      h      Cranes  NaN       2      yes
8      i  spoonbills  8.0       3       no
4      e  spoonbills  6.0       3       no
2      c     plovers  1.5       3       no
1      b      Cranes  4.0       4      yes
5      f      Cranes  3.0       4       no
3      d  spoonbills  NaN       4      yes

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [38]:
f=df.replace({'yes':1,'no':0})
f

  Labels       birds  age  visits  priority
0      a      Cranes  3.5       2         1
1      b      Cranes  4.0       4         1
2      c     plovers  1.5       3         0
3      d  spoonbills  NaN       4         1
4      e  spoonbills  6.0       3         0
5      f      Cranes  3.0       4         0
6      g     plovers  5.5       2         0
7      h      Cranes  NaN       2         1
8      i  spoonbills  8.0       3         0
9      j  spoonbills  4.0       2         0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [124]:
df.replace({'Cranes':'trumpeters'})

  Labels       birds  age  visits priority
0      a  trumpeters  3.5       2      yes
1      b  trumpeters  4.0       4      yes
2      c     plovers  1.5       3       no
3      d  spoonbills  NaN       4      yes
4      e  spoonbills  6.0       3       no
5      f  trumpeters  3.0       4       no
6      g     plovers  5.5       2       no
7      h  trumpeters  NaN       2      yes
8      i  spoonbills  8.0       3       no
9      j  spoonbills  4.0       2       no